app/Http/Controllers/SalaryController.php

  public function geren($id = 0,$jj = null)
    {
      $id = $id?$id:Auth::user()->id;
      if (\Auth::user()->id != 39&&\Auth::user()->id != 36) {
               if (\Auth::check()) {
          $id = \Auth::user()->id;
        }
       $this->authorize('update', User::find($id));
      }
      // \Log::useFiles(storage_path('/logs/log.log'),'debug');
      // \Log::info(\Auth::user()->name."登陆了，登陆时间：".\Carbon\Carbon::now());
      error_log(\Auth::user()->name."登陆了，登陆时间：".\Carbon\Carbon::now().PHP_EOL,3,storage_path($path = '/logs/logins.log'));

       $res = Salary::hasJJ($jj)
           ->where('member_id',$id)
           ->Hasjj($jj)
           ->get()
           ->groupBy('date');
       $resv=Salary::hasJJ($jj)
           ->where('member_id',$id)
           ->Hasjj($jj)
           ->get();
---
select * from `salaries` where `member_id` = '39'